---
Description: Downloads the latest version of GIMP from gimp.org and builds a package.
Identifier: com.github.grahampugh.pkg.GIMP
Input:
  NAME: GIMP
MinimumVersion: 0.5.2
ParentRecipe: io.github.hjuutilainen.download.GIMP
Process:
- Arguments:
    dmg_path: '%pathname%'

  Processor: AppDmgVersioner
- Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
  Processor: PkgRootCreator
- Arguments:
    destination_path: '%pkgroot%/Applications/%NAME%.app'
    source_path: '%pathname%/*.app'
  Processor: Copier
- Arguments:
    gimp_app_path: '%pkgroot%/Applications/%NAME%.app'
  Processor: GIMPPermissionsFixer
- Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.gimp.GIMP
      options: purge_ds_store
      pkgdir: '%RECIPE_CACHE_DIR%'
    pkgname: '%NAME%-%version%'
  Processor: PkgCreator

